#+TITLE: Postgresql 

* HACKS

#+begin_src sql
SELECT * FROM pg_roles WHERE rolname ilike 'e%';
#+end_src

#+RESULTS:
| ALTER ROLE |          |            |               |             |             |                |              |             |               |              |           |       |
|------------+----------+------------+---------------+-------------+-------------+----------------+--------------+-------------+---------------+--------------+-----------+-------|
| rolname    | rolsuper | rolinherit | rolcreaterole | rolcreatedb | rolcanlogin | rolreplication | rolconnlimit | rolpassword | rolvaliduntil | rolbypassrls | rolconfig |   oid |
| ecm        | t        | t          | f             | f           | t           | f              |           -1 | ********    |               | f            |           | 72450 |

#+BEGIN_SRC sql
SELECT CURRENT_USER 
      , inet_server_addr()
       host -- use inet_client_addr() to get address of the remote connection
      , inet_client_addr()
      , inet_server_port() port -- use inet_client_port() to get port of the remote connection
#+END_SRC

#+RESULTS:
| current_user | host | inet_client_addr | port |
|--------------+------+------------------+------|
| maxclaims    | ::1  | ::1              | 5434 |

#+END_SRC
#+BEGIN_SRC gerbil 
  (import :std/db/dbi :std/db/postgresql)

  (def db (postgresql-connect
	   host: "athena.maxwellclaims.net"
	   port: 5433
	   user: "maxclaims"
	   passwd: "PASSWORD"))

  (sql-eval-query db "SELECT version();")


#+END_SRC

#+BEGIN_SRC shell
pg_dumpall --host cora.maxwellclaims.net --user=maxclaims --clean | psql -d postgres
#+END_SRC

*** to_regclass

#+BEGIN_SRC sql
CREATE OR REPLACE FUNCTION to_regclass(anyelement)
 RETURNS regclass LANGUAGE SQL AS $$ 
   SELECT to_regclass($1::text) ;
$$;

#+END_SRC

#+RESULTS:
| CREATE FUNCTION |
|-----------------|

 #+BEGIN_SRC sql :results code :exports none
 select pg_get_functiondef(oid)
 from pg_proc
 where proname = 'describe_pkey';
 #+END_SRC

 #+BEGIN_SRC sql
 CREATE OR REPLACE FUNCTION pongo.describe_pkey(anyelement)
  RETURNS json
  LANGUAGE sql
 AS $function$
 -- => json array of {"name":"","type":""} objects
 -- Tell us what the pkeys columns are, and their types.
 SELECT json_agg(pkeys)
  FROM (SELECT a.attname AS name, format_type(a.atttypid, a.atttypmod) AS type
	  FROM   pg_index i
	  JOIN   pg_attribute a ON a.attrelid = i.indrelid
			     AND a.attnum = ANY(i.indkey)
	  WHERE  i.indrelid = to_regclass(pg_typeof($1)::text::cstring)
	  AND    i.indisprimary) AS pkeys;

 $function$

 #+END_SRC

 #+RESULTS:
 | CREATE FUNCTION |
 |-----------------|



*** misc 
#+BEGIN_SRC sql :engine postgresql :cmdline "--port 5432 --host ecm.maxwellclaims.net --user maxclaims maxclaims" 
SELECT version();
#+END_SRC

#+BEGIN_SRC sql :engine postgresql :cmdline "--port 5433 --host athena.maxwellclaims.net --user maxclaims maxclaims" 
SELECT version();
#+END_SRC

#+RESULTS:
| version                                                                                                        |
|----------------------------------------------------------------------------------------------------------------|
| PostgreSQL 10.1 on x86_64-pc-linux-gnu, compiled by gcc (Ubuntu 5.4.0-6ubuntu1~16.04.4) 5.4.0 20160609, 64-bit |

#+BEGIN_SRC sql
CREATE OR REPLACE FUNCTION public.to_regclass(cstring)
 RETURNS pg_catalog.regclass LANGUAGE SQL AS $$
  SELECT pg_catalog.to_regclass($1::text) ;
$$;

#+END_SRC
